backend/controllers/CourseController.php

SELECT * FROM `course` WHERE `c_id`='7'
---
    protected function findModel($id)
    {
        if (($model = Course::findOne($id)) !== null) {