backend/controllers/ScheduleController.php

    public function actionCreate()
    {
        $model = new Schedule();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `schedule` (`c_id`, `t_id`, `s_id`, `location`, `date`) VALUES (4, 6, 5, 'London', '2021-11-26')