backend/controllers/SlotController.php

    public function actionCreate()
    {
        $model = new Slot();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `slot` (`s_name`, `from_time`, `to_time`) VALUES ('A Slot', '15', '18')

    protected function findModel($id)
    {
        if (($model = Slot::findOne($id)) !== null) {
---
SELECT * FROM `slot` WHERE `s_id`='9'