backend/views/schedule/_form.php


    <?php

$courses=Course::find()->all();
---
SELECT * FROM `course`


        ?>
<?php
$dataCategory=ArrayHelper::map(Trainer::find()->asArray()->all(), 't_id', 't_name');
---
SELECT * FROM `trainer`

				});
			']);

	$dataPost=ArrayHelper::map(Slot::find()->asArray()->all(), 's_id', 's_name');
---
SELECT * FROM `slot`